{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 384,
  "id2label": {
    "0": "love_bombing",
    "1": "intimacy_escalation",
    "2": "emotional_isolation",
    "3": "deceptive_offer",
    "4": "off_platform_request"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "label2id": {
    "deceptive_offer": 3,
    "emotional_isolation": 2,
    "intimacy_escalation": 1,
    "love_bombing": 0,
    "off_platform_request": 4
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "transformers_version": "4.57.6",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 250037
}
